Merge remote changes, apply README redesign
